Revit 2024 API
SpotDimension.LeaderShoulderPosition Property
 Position of spot dimension's leader shoulder point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public XYZ LeaderShoulderPosition { get; set; }
Visual Basic
Public Property LeaderShoulderPosition As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ LeaderShoulderPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 Setting of this property also affects LeaderEndPosition and TextPosition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Dimension must have leader. -or- Dimension's leader must have shoulder. -or- Thrown when:
SpotDimension style type is SpotSlope.
Using equality formula.
Dimension style is ordinate.
 -or- The dimension is a SpotSlope or has no leader or leader has no shoulder.
See Also
SpotDimension Class
Autodesk.Revit.DB Namespace